{"pageProps":{"source":{"compiledSource":"var u=Object.defineProperty,c=Object.defineProperties;var p=Object.getOwnPropertyDescriptors;var i=Object.getOwnPropertySymbols;var s=Object.prototype.hasOwnProperty,r=Object.prototype.propertyIsEnumerable;var h=(e,t,o)=>t in e?u(e,t,{enumerable:!0,configurable:!0,writable:!0,value:o}):e[t]=o,a=(e,t)=>{for(var o in t||(t={}))s.call(t,o)&&h(e,o,t[o]);if(i)for(var o of i(t))r.call(t,o)&&h(e,o,t[o]);return e},l=(e,t)=>c(e,p(t));var d=(e,t)=>{var o={};for(var n in e)s.call(e,n)&&t.indexOf(n)<0&&(o[n]=e[n]);if(e!=null&&i)for(var n of i(e))t.indexOf(n)<0&&r.call(e,n)&&(o[n]=e[n]);return o};const makeShortcode=e=>function(o){return console.warn(\"Component \"+e+\" was not imported, exported, or provided by MDXProvider as global scope\"),mdx(\"div\",a({},o))},Slide=makeShortcode(\"Slide\"),layoutProps={},MDXLayout=\"wrapper\";function MDXContent(o){var n=o,{components:e}=n,t=d(n,[\"components\"]);return mdx(MDXLayout,l(a(a({},layoutProps),t),{components:e,mdxType:\"MDXLayout\"}),mdx(Slide,{mdxType:\"Slide\"},mdx(\"h2\",null,\"Plato on Knowledge vs. True Opinion\"),mdx(\"p\",null,\"Men. I admit the cogency of your argument, and therefore, Socrates, I wonder that knowledge should be preferred to right opinion-or why they should ever differ.\"),mdx(\"p\",null,\"Soc. And shall I explain this wonder to you?\"),mdx(\"p\",null,\"Men. Do tell me.\"),mdx(\"p\",null,\"Soc. You would not wonder if you had ever observed the images of Daedalus; but perhaps you have not got them in your country?\"),mdx(\"p\",null,\"Men. What have they to do with the question?\"),mdx(\"p\",null,\"Soc. Because they require to be fastened in order to keep them, and if they are not fastened they will play truant and run away.\"),mdx(\"p\",null,\"Men. Well. what of that?\"),mdx(\"p\",null,\"Soc. I mean to say that they are not very valuable possessions if they are at liberty, for they will walk off like runaway slaves; but when fastened, they are of great value, for they are really beautiful works of art. Now this is an illustration of the nature of true opinions: while they abide with us they are beautiful and fruitful, but they run away out of the human soul, and do not remain long, and therefore they are not of much value until they are fastened by the tie of the cause; and this fastening of them, friend Meno, is recollection, as you and I have agreed to call it. But when they are bound, in the first place, they have the nature of knowledge; and, in the second place, they are abiding. And this is why knowledge is more honourable and excellent than true opinion, because fastened by a chain.\")),mdx(Slide,{mdxType:\"Slide\"},mdx(\"img\",{width:\"90%\",src:\"https://s3.amazonaws.com/lum-faculty-jcwitt-public/pl201/particularsToUniversals.png\"})),mdx(Slide,{mdxType:\"Slide\"},mdx(\"img\",{width:\"90%\",src:\"https://s3.amazonaws.com/lum-faculty-jcwitt-public/pl201/universalsToParticulars.png\"})),mdx(Slide,{mdxType:\"Slide\"},mdx(\"h2\",null,\"PostAn 1.1, 71b (p. 39)\"),mdx(\"p\",null,`\"But, I think, it is quite possible for us to know in one way what we are learning,\nwhile being ignorant of it in another way. For what is absurd is not that\nwe already know in some way the very thing we are learning; the absurdity arises\nonly if we already know it to the precise extent and in the precise way in which we are learning it.\"`)),mdx(Slide,{mdxType:\"Slide\"},mdx(\"h2\",null,\"PostAn 1.2\"),mdx(\"p\",null,\"We suppose ourselves to possess unqualified scientific knowledge of a thing, as opposed to knowing it in the accidental way in which the sophist knows, when we think that we know the cause on which the fact depends, as the cause of that fact and of no other, and, further, that the fact could not be other than it is. Now that scientific knowing is something of this sort is evident-witness both those who falsely claim it and those who actually possess it, since the former merely imagine themselves to be, while the latter are also actually, in the condition described. Consequently the proper object of unqualified scientific knowledge is something which cannot be other than it is.\")),mdx(Slide,{mdxType:\"Slide\"},mdx(\"h2\",null,\"PostAn 1.2\"),mdx(\"p\",null,\"There may be another manner of knowing as well-that will be discussed later. What I now assert is that at all events we do know by demonstration. By demonstration I mean a syllogism productive of scientific knowledge, a syllogism, that is, the grasp of which is eo ipso such knowledge. \"),mdx(\"p\",null,\"Assuming then that my thesis as to the nature of scientific knowing is correct, the premisses of demonstrated knowledge must be true, primary, immediate, better known than and prior to the conclusion, which is further related to them as effect to cause. \"),mdx(\"p\",null,\"Unless these conditions are satisfied, the basic truths will not be 'appropriate' to the conclusion. Syllogism there may indeed be without these conditions, but such syllogism, not being productive of scientific knowledge, will not be demonstration. \"),mdx(\"p\",null,\"The premisses must be true: for that which is non-existent cannot be known-we cannot know, e.g. that the diagonal of a square is commensurate with its side. \"),mdx(\"p\",null,\"The premisses must be primary and indemonstrable; otherwise they will require demonstration in order to be known, since to have knowledge, if it be not accidental knowledge, of things which are demonstrable, means precisely to have a demonstration of them. \"),mdx(\"p\",null,\"The premisses must be the causes of the conclusion, better known than it, and prior to it; its causes, since we possess scientific knowledge of a thing only when we know its cause; prior, in order to be causes; antecedently known, this antecedent knowledge being not our mere understanding of the meaning, but knowledge of the fact as well. Now 'prior' and 'better known' are ambiguous terms, for there is a difference between what is prior and better known in the order of being and what is prior and better known to man. I mean that objects nearer to sense are prior and better known to man; objects without qualification prior and better known are those further from sense. Now the most universal causes are furthest from sense and particular causes are nearest to sense, and they are thus exactly opposed to one another. In saying that the premisses of demonstrated knowledge must be primary, I mean that they must be the 'appropriate' basic truths, for I identify primary premiss and basic truth. A 'basic truth' in a demonstration is an immediate proposition. An immediate proposition is one which has no other proposition prior to it. \")),mdx(Slide,{mdxType:\"Slide\"},mdx(\"img\",{width:\"90%\",src:\"https://s3.amazonaws.com/lum-faculty-jcwitt-public/pl201/induction.png\"})))}MDXContent.isMDXComponent=!0;\n","scope":{"title":"4 (Slides) Aristotle, Posterior Analytics, Book I, cc. 1-6, pp. 37-52; Book II, c. 19, pp. 66-68Clas","description":"Bertrand Russell, In Praise of Idleness"}},"frontMatter":{"title":"4 (Slides) Aristotle, Posterior Analytics, Book I, cc. 1-6, pp. 37-52; Book II, c. 19, pp. 66-68Clas","description":"Bertrand Russell, In Praise of Idleness"}},"__N_SSG":true}