{"pageProps":{"source":{"compiledSource":"var u=Object.defineProperty,h=Object.defineProperties;var c=Object.getOwnPropertyDescriptors;var i=Object.getOwnPropertySymbols;var a=Object.prototype.hasOwnProperty,r=Object.prototype.propertyIsEnumerable;var d=(e,t,n)=>t in e?u(e,t,{enumerable:!0,configurable:!0,writable:!0,value:n}):e[t]=n,s=(e,t)=>{for(var n in t||(t={}))a.call(t,n)&&d(e,n,t[n]);if(i)for(var n of i(t))r.call(t,n)&&d(e,n,t[n]);return e},l=(e,t)=>h(e,c(t));var p=(e,t)=>{var n={};for(var o in e)a.call(e,o)&&t.indexOf(o)<0&&(n[o]=e[o]);if(e!=null&&i)for(var o of i(e))t.indexOf(o)<0&&r.call(e,o)&&(n[o]=e[o]);return n};const makeShortcode=e=>function(n){return console.warn(\"Component \"+e+\" was not imported, exported, or provided by MDXProvider as global scope\"),mdx(\"div\",s({},n))},QuestionBlock=makeShortcode(\"QuestionBlock\"),Question=makeShortcode(\"Question\"),Answer=makeShortcode(\"Answer\"),BabylonViewerWrapper=makeShortcode(\"BabylonViewerWrapper\"),layoutProps={},MDXLayout=\"wrapper\";function MDXContent(n){var o=n,{components:e}=o,t=p(o,[\"components\"]);return mdx(MDXLayout,l(s(s({},layoutProps),t),{components:e,mdxType:\"MDXLayout\"}),mdx(\"p\",null,\"Our reading today is a little strange. It is a collection of fragments from early Greek Philosophers. \"),mdx(\"p\",null,`For context, please make sure you've read the \"Introduction\" by Patricia Curd (posted on Moodle) before turning to the fragments themselves. Use the questions to guide your reading of the individual fragments.`),mdx(QuestionBlock,{type:\"reading-content\",mdxType:\"QuestionBlock\"},'Consider the opening two fragments in our reader (fragments 1 and 2, p. 70a-b) from Hesiod and Homer (also quoted in the \"Presocratics Introduction\" posted on Moodle).',mdx(Question,{level:1,mdxType:\"Question\"},\"Both of these poets are trying explain the origins of the world: where do they get their information?\"),mdx(Question,{level:1,mdxType:\"Question\"},\"What kind of support or prior knowledge are they using to support their claims?\"),mdx(Question,{level:1,type:\"reading-discussion\",mdxType:\"Question\"},'As you reader further, compare these accounts to the attempts to find the \"cause\" or \"explanation\" of the world given by Thales, Anaximander, and Anaximenes.',mdx(Answer,{mdxType:\"Answer\"},mdx(\"p\",null,\"Consider the differences described by Patricia Curd. \"),mdx(\"blockquote\",null,mdx(\"p\",{parentName:\"blockquote\"},'\"...for Aristotle and those who came after him, Thales, and his fellow-Milesians Anaximander and Anaximenes, shared an outlook that truly marks the beginning of philosophical inquiry. Part of this was a willingness to speculate and give reasons based on evidence and argument. Another aspect was a commitment to the view that the natural world (the entire universe) can be explained without needing to refer to anything beyond nature itself.\" (Curd, \"Introduction\", ',mdx(\"em\",{parentName:\"p\"},\"Presocratics\"),\", pp. 1-2)\")),mdx(\"p\",null,\"How is this different from what we see in Homer and Hesiod?\"),mdx(\"p\",null,\"Do you see evidence of this difference in the fragments from Thales, Anaximander, and Anaximenes?\")))),mdx(QuestionBlock,{type:\"reading-content\",mdxType:\"QuestionBlock\"},mdx(Question,{level:1,mdxType:\"Question\"},\"How do fragments 3 and 4 (p. 70b) paint different portraits of the first philosopher?\"),mdx(Question,{level:2,mdxType:\"Question\"},\"What seems to be Thales' primary field of study?\"),mdx(Question,{level:2,mdxType:\"Question\"},\"Why does Thales appear foolish and impractical in the first fragment?\"),mdx(Question,{level:2,mdxType:\"Question\"},\"According to the second fragment, why isn't Thales a rich businessman?\")),mdx(QuestionBlock,{type:\"reading-content\",mdxType:\"QuestionBlock\"},mdx(Question,{level:1,mdxType:\"Question\"},\"According to fragment 5 (p. 70b), why do the early philosophers (including Thales) think that matter is the underlying principle of the world?\"),mdx(Question,{level:2,type:\"reading-discussion\",mdxType:\"Question\"},'When the fragment discusses \"principles,\" what do you think it means?'),mdx(Question,{level:2,mdxType:\"Question\"},\"What kind of specific matter does Thales take to be the underlying principle of the world? Why?\")),mdx(QuestionBlock,{type:\"reading-content\",mdxType:\"QuestionBlock\"},mdx(Question,{level:1,mdxType:\"Question\"},\"According to fragments 7-10 (p. 71a), what does Anaximander think is the first principle of the world? \"),mdx(Question,{level:2,type:\"reading-discussion\",mdxType:\"Question\"},\"How is this different from Thales?\")),mdx(QuestionBlock,{type:\"reading-content\",mdxType:\"QuestionBlock\"},mdx(Question,{level:1,mdxType:\"Question\"},\"How does Anaximenes disagree with both Thales and Anaximander about the nature of the single originative stuff? (See esp. fragment 11, p. 71b)\")),mdx(\"h2\",null,\"A Question for Thales\"),mdx(\"p\",null,`Thales wanted to find a single cause or explanation for the universe.\nIn pursuit of such an explanation he proposed that the entire universe\nis fundamentally made up of one element: water`),mdx(\"p\",null,`But if everything is water, how is Thales to account for our \"lived experience\" of variety and difference. Maybe everything is water. But why doesn't it all look like water?`),mdx(\"p\",null,\"If you think about it, this is still a question today that needs explaining. \"),mdx(\"p\",null,`I can point to an ice cube and you can tell me it is water.\nBut then I can point to a glass of water and you will tell me it is also water.\nAgain, I can point to a cloud in the sky and again you will tell me it is also water. `),mdx(QuestionBlock,{type:\"reading-discussion\",mdxType:\"QuestionBlock\"},mdx(Question,{mdxType:\"Question\"},'How can three different things, with such diverse properties, appearances, and behaviors really be the \"same\" thing?')),mdx(\"span\",{id:\"anaximenes-demo\"}),mdx(\"h2\",null,\"Anaximenes on Condensation and Rarefaction\"),mdx(\"p\",null,\"Anaximenes took the above question seriously. \"),mdx(\"p\",null,`If we're going to be able to explain the world in terms of a single cause (where this cause is some singular \"stuff\"), then the burden is on us to explain how this stuff can appear so \"qualitatively different\".`),mdx(\"p\",null,'In the scene below, there are three qualitatively different objects (perhaps one is \"hard\" and one is \"somewhat firm\" and the third is \"very soft\"). Let us imagine that each is composed of \"air\" (imagined as cubes), which Anaximenes proposed as an alternative to water. '),mdx(\"p\",null,\"Explore the three objects below. (Zoom in and out, rotate around and inspect each object.) The consider the questions below.\"),mdx(BabylonViewerWrapper,{mdxType:\"BabylonViewerWrapper\"}),mdx(QuestionBlock,{type:\"reading-discussion\",mdxType:\"QuestionBlock\"},mdx(Question,{mdxType:\"Question\"},\"Since each object is made of air (cubes), and in this case the same amount of cubes, what is left to explain our different experience of these three objects?\")),mdx(QuestionBlock,{type:\"reading-content\",mdxType:\"QuestionBlock\"},mdx(Question,{level:1,mdxType:\"Question\"},\"How does Anaximenes use the concept of condensation and rarefaction to explain our different experience of these objects?\")),mdx(QuestionBlock,{type:\"reading-discussion\",mdxType:\"QuestionBlock\"},mdx(Question,{level:1,mdxType:\"Question\"},\"Compare fragments 8 (p. 71a) and 11 (p. 71b). How can Anaximenes be seen as trying to add more precision to the account of change and variation already given by Anaximander?\")),mdx(QuestionBlock,{type:\"reading-content\",mdxType:\"QuestionBlock\"},mdx(Question,{level:1,mdxType:\"Question\"},'According to fragment 12 (p. 71b), why does \"Air\" always need to be moving?')),mdx(QuestionBlock,{type:\"reading-discussion\",mdxType:\"QuestionBlock\"},mdx(Question,{level:1,mdxType:\"Question\"},`In terms of explaining the world as we know it, with all its variety, why might Anaximander's focus on the principle of the world as \"moving\" and \"directive of other things\" be seen as an advance over Thales's explanation of the world in terms of water alone? `),mdx(Question,{level:2,mdxType:\"Question\"},\"What does it begin to account for that Thales's theory did not seem to address?  (Consider especially fragments 7 and 10 from Anaximander.)\")))}MDXContent.isMDXComponent=!0;\n","scope":{"title":"Patricia Curd, Presocratics Introduction; Fragments from Thales, Anaximander, Anaximenes","description":"Thales, Anaximander, Anaximenes","order":14,"published":true}},"frontMatter":{"title":"Patricia Curd, Presocratics Introduction; Fragments from Thales, Anaximander, Anaximenes","description":"Thales, Anaximander, Anaximenes","order":14,"published":true}},"__N_SSG":true}