{"pageProps":{"source":{"compiledSource":"var p=Object.defineProperty,c=Object.defineProperties;var u=Object.getOwnPropertyDescriptors;var r=Object.getOwnPropertySymbols;var s=Object.prototype.hasOwnProperty,a=Object.prototype.propertyIsEnumerable;var d=(e,o,t)=>o in e?p(e,o,{enumerable:!0,configurable:!0,writable:!0,value:t}):e[o]=t,i=(e,o)=>{for(var t in o||(o={}))s.call(o,t)&&d(e,t,o[t]);if(r)for(var t of r(o))a.call(o,t)&&d(e,t,o[t]);return e},l=(e,o)=>c(e,u(o));var h=(e,o)=>{var t={};for(var n in e)s.call(e,n)&&o.indexOf(n)<0&&(t[n]=e[n]);if(e!=null&&r)for(var n of r(e))o.indexOf(n)<0&&a.call(e,n)&&(t[n]=e[n]);return t};const makeShortcode=e=>function(t){return console.warn(\"Component \"+e+\" was not imported, exported, or provided by MDXProvider as global scope\"),mdx(\"div\",i({},t))},Slides=makeShortcode(\"Slides\"),Slide=makeShortcode(\"Slide\"),layoutProps={},MDXLayout=\"wrapper\";function MDXContent(t){var n=t,{components:e}=n,o=h(n,[\"components\"]);return mdx(MDXLayout,l(i(i({},layoutProps),o),{components:e,mdxType:\"MDXLayout\"}),mdx(Slides,{mdxType:\"Slides\"},mdx(Slide,{mdxType:\"Slide\"},mdx(\"h1\",null,\"Example 1\"),mdx(\"p\",null,\"1 The conditions under which many food animals are raised are unhealthy for humans. 2 To keep these animals alive, large quantities of drugs must be administered. 3 These drugs remain in the animals' flesh and are passed on to the humans who eat it.\")),mdx(Slide,{mdxType:\"Slide\"},mdx(\"h1\",null,\"Example 2\"),mdx(\"p\",null,`1 There is a lot of pressure on untenured college teachers to dumb down their courses.\n2 Administrators tend to rehire teachers who bring in more money,\nand 3 teachers who dumb down their classes do precisely this. Why?\nBecause 4 easier classes attract more students, and 5 more students means more money for the school.`),mdx(\"p\",null,'(Lynne Drury Lerych, \"Meeting the Bottom Line in the College Biz\")')),mdx(Slide,{mdxType:\"Slide\"},mdx(\"h1\",null,\"Example 3\"),mdx(\"p\",null,\"1 The use of ethanol as an additive in gasoline is really a bad idea. 2 Ethanol is produced from corn, and 3 when 40 percent of the annual corn crop is burned up in car engines, that obviously raises the price of corn for food. 4 Also, adding ethanol to gasoline is highly inefficient. 5 Ethanol yields about 30 percent less energy than gasoline, and 6 its more expensive to transport and handle than gasoline.\"),mdx(\"p\",null,'(Colin A. Carter and Henry I. Miller \"Corn for Food, Not Fuel\")')),mdx(Slide,{mdxType:\"Slide\"},mdx(\"h1\",null,\"Problem Number 3\"),mdx(\"p\",null,\"1 Homework stifles the thrill of learning in the mind of the student. 2 It instills an oppressive learn-or-else discipline. 3 It quenches the desire for knowledge and the love of truth. For these reasons 4 homework should never be assigned.\")),mdx(Slide,{mdxType:\"Slide\"},mdx(\"h1\",null,\"Problem Number 4\"),mdx(\"p\",null,\"1 When parents become old and destitute, the obligation of caring for them should be imposed on their children. 2 Clearly, children owe a debt to their parents. 3 Their parents brought them into the world and cared for them when they were unable to care for themselves. 4 This debt could be appropriately discharged by having grown children care for their parents.\")),mdx(Slide,{mdxType:\"Slide\"},mdx(\"h1\",null,\"Problem Number 8\"),mdx(\"p\",null,\"1 Contributions to relief organizations are often wasted. 2 Food sent to war-torn countries rarely reaches its destination, because 3 food distribution is controlled by the warring groups, and 4 these groups sell the food to buy weapons and ammunition.\")),mdx(Slide,{mdxType:\"Slide\"},mdx(\"h1\",null,\"Problem Number 9\"),mdx(\"p\",null,\"1 Research leading to the development of a scramjet engine is worthwhile. 2 Commercial aircraft incorporating such an engine could cross the Pacific in as little as two hours. 3 This would relieve the fatigue of flights from New York to Tokyo. Also, 4 such an engine could power future orbiting spacecraft.\"))))}MDXContent.isMDXComponent=!0;\n","scope":{"title":"Extended Arguments","description":null}},"frontMatter":{"title":"Extended Arguments","description":null}},"__N_SSG":true}