{"pageProps":{"source":{"compiledSource":"var u=Object.defineProperty,c=Object.defineProperties;var d=Object.getOwnPropertyDescriptors;var n=Object.getOwnPropertySymbols;var a=Object.prototype.hasOwnProperty,r=Object.prototype.propertyIsEnumerable;var h=(e,t,o)=>t in e?u(e,t,{enumerable:!0,configurable:!0,writable:!0,value:o}):e[t]=o,s=(e,t)=>{for(var o in t||(t={}))a.call(t,o)&&h(e,o,t[o]);if(n)for(var o of n(t))r.call(t,o)&&h(e,o,t[o]);return e},l=(e,t)=>c(e,d(t));var p=(e,t)=>{var o={};for(var i in e)a.call(e,i)&&t.indexOf(i)<0&&(o[i]=e[i]);if(e!=null&&n)for(var i of n(e))t.indexOf(i)<0&&r.call(e,i)&&(o[i]=e[i]);return o};const makeShortcode=e=>function(o){return console.warn(\"Component \"+e+\" was not imported, exported, or provided by MDXProvider as global scope\"),mdx(\"div\",s({},o))},QuestionBlock=makeShortcode(\"QuestionBlock\"),Question=makeShortcode(\"Question\"),layoutProps={},MDXLayout=\"wrapper\";function MDXContent(o){var i=o,{components:e}=i,t=p(i,[\"components\"]);return mdx(MDXLayout,l(s(s({},layoutProps),t),{components:e,mdxType:\"MDXLayout\"}),mdx(\"p\",null,\"Today and Monday is listed a little Interlude for before we begin our final weeks exploring some themes in the field of Ethics with the help of Aristotle. \"),mdx(\"p\",null,\"One reason for our little \\u201Cinterlude\\u201D is that Philosophy tries to pick one text each year as a kind of \\u201Ccommon text\\u201D across all PL201 sections. \"),mdx(\"p\",null,\"This year the department chose the \",mdx(\"em\",{parentName:\"p\"},\"Tao te ching\"),\" by Lao Tzu.\"),mdx(\"p\",null,\"In addition to being a very interesting and thought-provoking text in its own right, this text actually fits somewhat nicely in the flow of our course. \"),mdx(\"p\",null,\"Before turning to reading questions, let me offer a few reasons why this text connects well with what we have already done so far and where we are going. \"),mdx(\"ul\",null,mdx(\"li\",{parentName:\"ul\"},mdx(\"p\",{parentName:\"li\"},\"First, the text was written at a similar period in history to when the Pre-Socrates (Heraclitus, Parmenides, etc.) were writing.\"),mdx(\"ul\",{parentName:\"li\"},mdx(\"li\",{parentName:\"ul\"},\"Thus, it is helps to broaden and diversify our understanding of Philosophy. This text helps us see that the \\u201Clove of wisdom\\u201D is not Greek or Western Intervention, but a human one.\"),mdx(\"li\",{parentName:\"ul\"},\"While the writing format can be unfamiliar, I think we can see many themes in the \",mdx(\"em\",{parentName:\"li\"},\"Tao te ching\"),\" that the earlier Ancient Greek thinkers were also exploring.\"))),mdx(\"li\",{parentName:\"ul\"},mdx(\"p\",{parentName:\"li\"},\"Second, as we transition from our consideration of metaphysics to a our final unit on ethics, the \",mdx(\"em\",{parentName:\"p\"},\"Tao te ching\"),\" appears highly relevant because many of the chapters make explicit connections between metaphysics and ethics.\"),mdx(\"ul\",{parentName:\"li\"},mdx(\"li\",{parentName:\"ul\"},mdx(\"p\",{parentName:\"li\"},\"Many of these chapters seem to begin from a kind of metaphysical observation about the nature of the universe, and then draw from this implications about how one ought to live their life, or how society ought to be ordered, or how rulers ought to conduct themselves. \")),mdx(\"li\",{parentName:\"ul\"},mdx(\"p\",{parentName:\"li\"},\"This connection between metaphysics and ethics, is a connection that Aristotle is going to make explicit in his \",mdx(\"em\",{parentName:\"p\"},\"Ethics\"),\". \")),mdx(\"li\",{parentName:\"ul\"},mdx(\"p\",{parentName:\"li\"},\"Thus, the \",mdx(\"em\",{parentName:\"p\"},\"Tao te ching\"),\" gives us a fun a way to explore these kinds of connections and think about the degree to which one position leads to another. \"))))),mdx(\"p\",null,`\"Exploration\" is good word for how I want us to approach this text over the next two class meetings. I don't begin with a lot of pre-conceived ideas of what this text is about or what you should take away from it. I want to be a co-explorer with you. Together, let's read the text and then as a class generate ideas about what kinds of metaphysical claims we think the author is making and the implications for ethics that seem to follow from these claims. `),mdx(\"p\",null,'With this in mind, before considering the questions below, please first read the PDF on Moodle \"How to read the ',mdx(\"em\",{parentName:\"p\"},\"Tao te ching\"),'\" by Moeller. This will give you some nice context about the text before turning to specific chapters. ',mdx(\"strong\",{parentName:\"p\"},\"I also highly recommend reading the short introduction provided in the assigned text\"),\".\"),mdx(\"p\",null,\"All of the listed chapters that I'm asking you to look closely at are the chapters used by Moeller in his example of how to navigate through the text. \"),mdx(\"p\",null,\"But beyond looking at these chapters, please explore and ruminate on of the chapters that really stand out to you. Ask yourself why you find this particular chapter, provocative, interesting, or evening troubling. \"),mdx(\"p\",null,\"In addition to your own explorations, here are some questions I would like you to consider as you read.\"),mdx(QuestionBlock,{type:\"reading-discussion\",mdxType:\"QuestionBlock\"},mdx(Question,{level:1,mdxType:\"Question\"},\"From our sample chapters, what kind of metaphysical claims do you see being made?\"),mdx(Question,{level:2,mdxType:\"Question\"},\"How is the Tao described?\"),mdx(Question,{level:2,mdxType:\"Question\"},\"What role or function is ascribed to it?\"),mdx(Question,{level:2,mdxType:\"Question\"},\"Do you see in any similarities to the kinds of claims made by the Pre-Socrates?\"),mdx(Question,{level:3,mdxType:\"Question\"},\"For example, Heraclitus, Parmeindes, or Anaxagoras?\"),mdx(Question,{level:3,mdxType:\"Question\"},\"Do you see any similarities to the views of Plato and the role of the Forms?\")),mdx(\"p\",null,\"As we transition to our Ethics unit, I want to think more and more about the kinds of implications that our views on metaphysics have for our views on Ethics\"),mdx(QuestionBlock,{type:\"reading-discussion\",mdxType:\"QuestionBlock\"},mdx(Question,{level:1,mdxType:\"Question\"},\"Based on the description of the Tao, what kind of advice for living is recommended by the Tao te ching?\"),mdx(Question,{level:2,mdxType:\"Question\"},\"In what way does this advice follow from the metaphysical claims about the Tao?\"),mdx(Question,{level:2,mdxType:\"Question\"},\"How do the sample chapters describe Virtue (Te)?\"),mdx(Question,{level:2,mdxType:\"Question\"},\"What are some of the descriptions of the virtuous person? \"),mdx(Question,{level:2,mdxType:\"Question\"},'How do these descriptions of virtue compare with your first associations with the idea of \"virtue\"?'),mdx(Question,{level:3,mdxType:\"Question\"},\"Do these descriptions resonate with you? Do they suggest positive ideas worth adopting? How so? Why?\"),mdx(Question,{level:3,mdxType:\"Question\"},\"Do these descriptions seem surprising, counterintuitive, or even problematic to you? How so? Why?\")))}MDXContent.isMDXComponent=!0;\n","scope":{"title":"Moeller, 'How to read the Tao te ching' and Lao Tsu, 'Tao Te Ching' (TTC), chapters 4, 5, 6, 8, 11, 15, 28, 39, 40, 41, 42, 52, 61, 66, 78","description":"Moeller, 'How to read the Tao te ching' and Lao Tsu, 'Tao Te Ching' (TTC), chapters 4, 5, 6, 8, 11, 15, 28, 39, 40, 41, 42, 52, 61, 66, 78"}},"frontMatter":{"title":"Moeller, 'How to read the Tao te ching' and Lao Tsu, 'Tao Te Ching' (TTC), chapters 4, 5, 6, 8, 11, 15, 28, 39, 40, 41, 42, 52, 61, 66, 78","description":"Moeller, 'How to read the Tao te ching' and Lao Tsu, 'Tao Te Ching' (TTC), chapters 4, 5, 6, 8, 11, 15, 28, 39, 40, 41, 42, 52, 61, 66, 78"}},"__N_SSG":true}